{
    "all":[
            {
                "title": "Implementing Nutanix High Availability and Disaster Recovery",
                "name": "Information & cyber security",
                "by": "Jaya Bodkhey",
                "rating": "16",
                "level": "Intermediate",
                "time": "51m",
                "shortDiscription": "Handling failures and disaster recovery is important to avail the data all the time to the end-user. This course will teach you the significance and configuration of high availability and disaster recovery for Nutanix hyperconverged solutions. ",
                "discription": "Failures and disasters are prone to happen in every ecosystem and data centers are no exception to that. A robust data center architecture needs to be up in every circumstance without losing any data. In this course, Implementing Nutanix High Availability and Disaster Recovery, you’ll learn to implement and maintain high availability and disaster recovery aspects of the Nutanix hyperconverged solutions. First, you’ll explore the high-level architecture of the Nutanix hyperconverged solutions and their building blocks. Next, you’ll discover how one can achieve high availability for Nutanix acropolis hypervisor. Finally, you’ll learn how the disaster recovery aspects works using different features offered by Nutanix hyperconverged solutions. When you’re finished with this course, you’ll have the skills and knowledge of “Implementing Nutanix High Availability and Disaster Recovery” needed to keep our data centers always up and running without suffering from any data loss.",
                "Author_Image_URL": "https://pluralsight.imgix.net/author/lg/b80f341a-6bfc-4b17-bb94-bfa90310eeca.jpg?w=100",
                "author_about": "Jaya is an Information Security and Automation Engineer. She has got 10 years of software industry experience in Information Security, Telecom, Finance and Automation domains. ",
                "date": "Sep 30, 2021"
              },
              {
                "title": " Salesforce Platform for Developers: The Big Picture",
                "by": "Don Robins",
                "rating": "11",
                "level": "Beginner",
                "time": "3h 38m",
                "shortDiscription": "In this course developers will learn about the depth and breadth of the Salesforce Platform, the many opportunities available across its multi-dimensional landscape, and how to align them to their development skills, experience, and domain interests.",
                "discription": "There is a common belief that opportunities for Salesforce developers are limited to building and supporting only Customer Relationship Management applications, but the platform yields much more than just that. In this course, Salesforce Platform for Developers: The Big Picture, you’ll learn about the depth and breadth of the full Salesforce Platform, its evolution to date over 20 years incorporating more than 60 product acquisitions, and the diverse opportunities where sophisticated development skills and experience are greatly needed by the growing customer base. These include modern web and mobile application development; security and functional configuration and maintenance; and data and process integration across a varied landscape of multiple business and technical domains using general-purpose development skills and traditional programming languages. By the time you’re done with this course, you’ll know where you can best focus your attention on developer opportunities that best match your particular skills and experience with a platform that offers endless opportunities.",
                "Author_Image_URL": "https://pluralsight.imgix.net/author/lg/d81c4a5f-aad3-45e5-b839-14de7f15028d.jpeg?w=100",
                "author_about": "Don Robins is a well known Salesforce MVP, instructor, author, and speaker.A custom business application developer for more decades than he cares toadmit, he focuses on Salesforce technical instruction and knowledgesharing",
                "date": "Sep 16, 2021"
              },
              {
                "title": " Using Operators, Decision, and Looping Constructs (Java SE 8 Programmer I Certification 1Z0-808)",
                "by": "Andrejs Doronins",
                "rating": "14",
                "level": "Intermediate",
                "time": "1h 27m",
                "shortDiscription": "This course will teach you the tips, tricks, and pitfalls of using operators and flow control statements in Java to help you prepare for the certification exam.",
                "discription": "Operators such as “=” or “++” or if-else statements and loops are ubiquitous in any Java program. However, there are constructs that are used infrequently, and the more common ones may produce unexpected results (bugs) if one uses them improperly. In this course, Using Operators, Decision, and Looping Constructs (Java SE 8 Programmer I Certification 1Z0-808), you will learn the tips, tricks, and pitfalls of using Java operators and statements. First, you’ll explore the Java operators. Only some are required for the exam, but even those required are worth taking a closer look at to see what some of them do behind the scenes. Then, you’ll discover how simple omissions in branching and looping statements may completely change the program flow. Finally, you will take a deep dive into more advanced concepts of flow control and the small details that make all the difference. When you're finished with this course, you’ll have the skills and knowledge of Java operators and statements necessary to nail any exam question related to the topic.",
                "Author_Image_URL": "https://pluralsight.imgix.net/author/lg/b18db54b-9612-4937-94ba-f45bcec80d98.jpg?w=100",
                "author_about": "Andrejs is a Quality Assurance professional and participates in the entire SDLC - from requirements analysis, to test creation and their automation.",
                "date": "Jul 26, 2021"
              },
              {
                "title": " Impact with Slowloris",
                "by": "Pinal Dave",
                "rating": "17",
                "level": "Intermediate",
                "time": "21m",
                "shortDiscription": "In this course, you will learn impact with Slowloris. This read team engagement help us learn about HTTP Denial of Service attack that affects threaded servers.",
                "discription": "Knowing how to use Slowloris and how Denial of Service techniques can be used against you, will ultimately lead your organization to detect and defend against specific attacks. In this course, Impact with Slowloris, you’ll learn how to utilize Slowloris to execute impact in a red team environment. First, you’ll discuss this tool, the legal aspects, and the outcome you can expect from the engagement. Next, you'll learn about the installation and environmental setup of Slowloris. Finally, you’ll simulate a Denial of Service attack. When you’re finished with this course, you’ll have the skills and knowledge to execute these Denial of Service attack techniques using Slowloris.",
                "Author_Image_URL": "https://pluralsight.imgix.net/author/lg/pinal-dave-v1.jpg?w=100",
                "author_about": "Pinal Dave is a Pluralsight Developer Evangelist.",
                "date": "May 20, 2021"
              },
              {
                "title": " Developing Python Apps with Docker",
                "name": "Software development",
                "by": "Steven Haines",
                "rating": "17",
                "level": "Intermediate",
                "time": "2h 28m",
                "shortDiscription": "Moving from a traditional architecture to a containerized architecture can be intimidating. This course will teach you how to use Docker and Docker Compose to build and deploy highly scalable Python applications.",
                "discription": "Building highly scalable Python applications in a microservices-based architecture can be challenging. In this course, Developing Python Apps with Docker, you'll learn how to run highly scalable Python applications in Docker containers. First, you'll explore how to create a Dockerfile and containerize a Python application. Next, you'll discover how to create and connect multiple docker containers together using Docker Compose. Finally, you'll learn how to make your application production-ready and debug it while it's running in a container. When you're finished with this course, you'll have the skills and knowledge of using Python with Docker that is needed to build robust and scalable Python applications in Docker.",
                "Author_Image_URL": "https://pluralsight.imgix.net/author/lg/336f4c57-27fd-4904-80f9-531c1fee3d5a.png?w=100",
                "author_about": "Steven Haines is a principal software architect at Turbonomic, focusing on their cloud offering. He has authored three Java books, over 500 articles, and a couple dozen white papers, as well as teaching Java at the University of California, Irvine.",
                "date": "May 17, 2021"
              },
              {
                "title": " FluentValidation Fundamentals",
                "name": "Software development",
                "by": "Vladimir Khorikov",
                "rating": "74",
                "level": "Intermediate",
                "time": "3h 48m",
                "shortDiscription": "This course will teach you how to use FluentValidation library to perform validation in ASP.NET Core applications. FluentValidation is a free and open-source library developed by Jeremy Skinner at https://fluentvalidation.net",
                "discription": "Input validation is a vast and complicated topic, and it’s often unclear what tools to use and best practices to follow in this area. In this course, FluentValidation Fundamentals, you’ll learn to perform validation in ASP.NET Core applications. First, you’ll explore the features of the FluentValidation library. Next, you’ll discover how to combine them with DDD best practices. Finally, you’ll learn how to use attributes as an alternative to the library. When you’re finished with this course, you’ll have the skills and knowledge of validation and the FluentValidation library needed to perform validation in any ASP.NET Core application. FluentValidation is developed by Jeremy Skinner.",
                "Author_Image_URL": "https://pluralsight.imgix.net/author/lg/vladimir-khorikov-v1.jpg?w=100",
                "author_about": "Vladimir Khorikov is a Microsoft MVP and has been professionally involvedin software development for more than 10 years.",
                "date": "May 13, 2021"
              },
              {
                "title": " Cisco Advanced Routing: Leaf/Spine Data Centers",
                "name": "Software development",
                "by": "Nick Russo",
                "rating": "13",
                "level": "Advanced",
                "time": "3h 7m",
                "shortDiscription": "Modern data center design is becoming increasingly reliant on layer-3 routing technologies. This course will teach you how to configure and troubleshoot routing protocols and IP services using a large-scale network topology. ",
                "discription": "Leaf/spine architectures have exploded in popularity within data centers and enterprise campus networks. In this course, Cisco Advanced Routing: Leaf/Spine Data Centers, you’ll learn to design, configure, and manage a multi-site data center interconnected via layer-3 links. First, you’ll expand your OSPF knowledge by learning about special area types and virtual links. Next, you’ll discover using internal BGP for scalable distribution of IP prefixes within a data center fabric. Finally, you’ll learn how to optimize the network using a subset of common IP services relating to management, monitoring, and security. Most of these topics are discussed using both IPv4 and IPv6 in the context of dual-stacking. When you’re finished with this course, you’ll have the skills and knowledge of Cisco layer-3 data center networking needed to deploy complex routing designs in your work environment.",
                "Author_Image_URL": "https://pluralsight.imgix.net/author/lg/fe6d683f-1533-4a44-9810-ad066cbf90c1.png?w=100",
                "author_about": "Nick Russo, CCDE #20160041 and CCIE #42518, is your go-to-guy for all things networking and automation. Nick loves training online and speaking at industry conferences sharing his expertise.",
                "date": "May 4, 2021"
              },
              {
                "title": " Cisco Advanced Routing: Tier 3 Service Providers",
                "name": "Software development",
                "by": "Nick Russo",
                "rating": "18",
                "level": "Advanced",
                "time": "3h 46m",
                "shortDiscription": "Service Provider networks are great places to expand your networking skills and perspectives. This course will teach you how to configure and troubleshoot routing protocols and IP services using a large-scale network topology. ",
                "discription": "Believe it or not, enterprise and service provider networking technologies are converging, and this course helps illustrate that. In this course, Cisco Advanced Routing: Tier 3 Service Providers, you’ll learn to design, configure, and manage a small Internet Service Provider (ISP), which in many ways resembles a large enterprise. First, you’ll explore OSPF, a complex and popular routing protocol common deployed in enterprises and service providers alike. Next, you’ll apply BGP both for upstream Internet connectivity and MPLS layer-3 VPN service, which large enterprises commonly use to provide multi-tenancy at scale. Finally, you’ll learn how to optimize the network using a subset of common IP services relating to management, monitoring, and security. Most of these topics are discussed using both IPv4 and IPv6 in the context of dual-stacking. When you’re finished with this course, you’ll have the skills and knowledge of Cisco enterprise networking needed to manage large sized enterprise networks.",
                "Author_Image_URL": "https://pluralsight.imgix.net/author/lg/fe6d683f-1533-4a44-9810-ad066cbf90c1.png?w=100",
                "author_about": "Nick Russo, CCDE #20160041 and CCIE #42518, is your go-to-guy for all things networking and automation. Nick loves training online and speaking at industry conferences sharing his expertise.",
                "date": "Apr 14, 2021"
              },
              {
                "title": " Exam Alert: Design Data Storage in Microsoft Azure",
                "name": "Software development",
                "by": "John Savill",
                "rating": "11",
                "level": "Advanced",
                "time": "44m",
                "shortDiscription": "Preparing for an exam can be scary and confusing. This course will teach you what to expect and how to maximize your learning and be successful.",
                "discription": "When faced with preparing for exams it's not always clear where best to spend time and how best to prepare. In this course, Exam Alert: Design Data Storage in Microsoft Azure, you’ll learn to arm yourself with the skills and knowledge to succeed. First, you’ll explore how to understand the core areas that are covered in the exam. Next, you’ll discover key resources to help gain knowledge specific to the technology area. Finally, you’ll learn how to improve and practice. When you’re finished with this course, you’ll have the skills and knowledge of designing data storage related to Microsoft certification needed to pass with confidence.",
                "Author_Image_URL": "https://pluralsight.imgix.net/author/lg/6ff4df45-748e-40c8-baee-6fafb0355791.jpg?w=100",
                "author_about": "John Savill is an 11-time MVP, and he holds many Microsoft certificationsincluding Azure Infrastructure and Azure Architecture specialist. John isthe author of the popular FAQ for Windows and a senior contributing editorto Windows IT Pro. John has written eight books on Microsoft technologiesincluding Mastering Microsoft Azure Infrastructure Services and MasteringWindows Server 2016 Hyper-V.",
                "date": "Nov 24, 2020"
              },
              {
                "title": " Creating a Living Style Guide with Sass and Vanilla JavaScript",
                "name": "Web development",
                "by": "Karen Menezes",
                "rating": "15",
                "level": "Intermediate",
                "time": "2h 42m",
                "shortDiscription": "This course will teach you how to create a custom style guide with global helpers and reusable components that you can recycle across different projects.",
                "discription": "Long-term software projects tend to suffer from multiple issues, including inconsistent branding, code bloat, and poor documentation. In this course, Creating a Living Style Guide with Sass and Vanilla JavaScript, you will gain the ability to architect a style guide that tackles these issues at a core level and bridges the gap between design and development. First, you will learn how to identify the building blocks of a design system. Next, you will discover how to translate these building blocks into modular styles and reusable components. Finally, you will explore how to add stateful styles for user interaction, as well as accessibility for users with different needs. When you are finished with this course, you will have the skills and knowledge of style guide driven development needed to build a lightweight, custom style guide.",
                "Author_Image_URL": "https://pluralsight.imgix.net/author/lg/karen-menezes-v1.jpg?w=100",
                "author_about": "Karen Menezes is a freelance UI developer and author who specializes in CSS.",
                "date": "Dec 23, 2019"
              },
              {
                "title": " Optimize Performance for React",
                "name": "Web development",
                "by": "Hendrik Swanepoel",
                "rating": "10)",
                "level": "Intermediate",
                "time": "55m",
                "shortDiscription": "React is known for its excellent performance characteristics, but you still need to be aware of common performance pitfalls and how to deal with it. This course will help you to get your React apps to be fast and efficient. ",
                "discription": "React app performance can suffer due to components rendering too often. It's also common for React app bundles to end up too large and take too long to download. In this course, Optimize Performance for React, you’ll learn how to identify and address common React performance issues. First, you’ll explore how to analyze and fix wasted renders on both class and functional components. Next, you’ll see how to cache expensive operation results. Finally, you’ll learn how to reduce your app bundle size using production builds and lazy component loading. When you’re finished with this course, you’ll have the skills and knowledge of React performance needed to ensure that your React apps download and execute as fast as possible.",
                "Author_Image_URL": "https://pluralsight.imgix.net/author/lg/hendrik-swanepoel-v1.jpg?w=100",
                "author_about": "In his day job Hendrik is a full stack coder from Cape Town. For a large part of his career he worked with .NET, but the last few years he spent most of his time with JavaScript.",
                "date": "Apr 16, 2020"
              },
              {
                "title": " Building Your First R Analytics Solution",
                "name": "Data professional",
                "by": "Charlotte Wickham",
                "rating": "15",
                "level": "Beginner",
                "time": "2h 6m",
                "shortDiscription": "In this course, you’ll see the entire workflow that data professionals use to produce their R analytics solutions. ",
                "discription": "You’ve been given the task of building your next analytics report in R. Your colleague has even shared some R code they think will help. But where do you start? You’re not even sure what to do with the .R file they shared. In this course, Building Your First R Analytics Solution, you’ll see the entire workflow that data professionals use to produce their R analytics solutions. First, you’ll start right at the beginning — setting up your own computer to run R code. Next, you’ll learn how to run, read, and write R code in RStudio. Finally, you'll discover how to organize your work with RStudio projects and how to communicate your work with R Markdown. By the end of the course, you’ll have not only produced a shareable report with R Markdown, you’ll have built your project so that anyone else can recreate the report too. You’ll be using the same tools and workflows as R professionals, and along the way, you’ll start building habits that ensure your analysis is organized, documented, and reproducible.",
                "Author_Image_URL": "https://pluralsight.imgix.net/author/lg/4b21bdcd-cb71-4d77-b0f6-e98b071ec2bd.jpg?w=100",
                "author_about": "Charlotte is a Data Scientist and Educator, who teaches in the Statistics Department at Oregon State University as well as operating her own consulting and training business.",
                "date": "Mar 23, 2020"
              },
              {
                "title": " Autodesk Vault Professional Installation and Setup",
                "name": "Manufacturing & design",
                "by": "Neil Cross",
                "rating": "12",
                "level": "Advanced",
                "time": "2h 25m",
                "shortDiscription": "Vault Professional is the flagship data management solution from Autodesk. This course will teach you the correct and best practice installation techniques.",
                "discription": "Deploying and maintaining a data management solution is crucial for engineering companies. In this course, Autodesk Vault Professional Installation and Setup, you'll learn how to deploy Autodesk Vault. First, you'll explore server and client installation. Next, you'll discover how to correctly install and configure the SQL instance and use the network deployment tools for client deployment. Finally, you'll learn how to create users and create Vaults. By the end of this course, you'll be equipped with an arsenal of essential knowledge to ensure you get it right first time. Software required: Autodesk Vault.",
                "Author_Image_URL": "https://pluralsight.imgix.net/author/lg/927c8438-d8df-4945-963f-e6994b03743a.jpg?w=100",
                "author_about": "He'd rather you didn't, but if you were to cut Neil open he would bleed Autodesk. A career spanning 20 years to date has been solely dedicated to supporting Autodesk software applications from almost every possible perspective. Kick starting off as an AutoCAD R14 draftsman, he then progressed into and enjoyed 8 years with a platinum Autodesk reseller delivering high level technical services & ATC training for Inventor & Vault Professional to some of the largest engineering businesses in the UK, not forgetting the smaller ones too!",
                "date": "Sep 11, 2017"
              },
              {
                "title": " Building Regression Models with scikit-learn",
                "name": "Business professional",
                "by": "Janani Ravi",
                "rating": "35",
                "level": "Intermediate",
                "time": "2h 41m",
                "shortDiscription": "This course covers important techniques such as ordinary least squares regression, moving on to lasso, ridge, and Elastic Net, and advanced techniques such as Support Vector Regression and Stochastic Gradient Descent Regression.",
                "discription": "Regression is one of the most widely used modeling techniques and is much beloved by everyone ranging from business professionals to data scientists. Using scikit-learn, you can easily implement virtually every important type of regression with ease.",
                "Author_Image_URL": "https://pluralsight.imgix.net/author/lg/3e3f81ff-ccbc-4bf6-9136-a177f83cc9c2.jpg?w=100",
                "author_about": "A problem solver at heart, Janani has a Masters degree from Stanford and worked for 7+ years at Google. She was one of the original engineers on Google Docs and holds 4 patents for its real-time collaborative editing framework.",
                "date": "Jun 28, 2019"
              },
              {
                "title": " Cisco Wireless Basic Operation and Configuration",
                "name": "Manufacturing & design",
                "by": "Ross Bagurdes",
                "rating": "18",
                "level": "Intermediate",
                "time": "1h 34m",
                "shortDiscription": "Wireless networks are a fundamental component of enterprise networks. This course will introduce 802.11 radio frequency basics, deployment principles, and configuration of a Cisco Wireless LAN Controller.",
                "discription": "Wireless networks are a required component of every enterprise network. Mobile devices like laptops, tablets, and smartphones have created a demand for wireless coverage in buildings. Additionally, devices specific to healthcare, manufacturing, education, retail also required reliable wireless connectivity to operate properly.",
                "Author_Image_URL": "https://pluralsight.imgix.net/author/lg/ross-bagurdes-v2.jpg?w=100",
                "author_about": "For nearly 20 years, Ross has taught and managed data networks.",
                "date": "Feb 24, 2020"
              },
              {
                "title": " Bootstrap 5: Fundamentals",
                "by": "Gill Cleeren",
                "rating": "26",
                "level": "Beginner",
                "time": "3h 23m",
                "shortDiscription": "Bootstrap is the most popular CSS framework for creating responsive mobile-first websites. This course will teach you how to create your first pages of a website using the Bootstrap v5 framework.",
                "discription": "Bootstrap is a vital tool in the toolbox of a web developer. It is key to creating responsive mobile-first websites. In this course, Bootstrap 5: Fundamentals, you’ll learn to use the Bootstrap framework in a hands-on way, covering v5 of the framework. First, you’ll explore the key parts of the Bootstrap 5 framework so you understand what Bootstrap can help you achieve. Next, you’ll discover how to create a responsive layout based on the Grid and other Bootstrap classes. Finally, you’ll learn how to add components to enhance the experience users will have on your site. When you’re finished with this course, you’ll have the skills and knowledge of Bootstrap v5 needed to build modern, mobile-first websites.",
                "Author_Image_URL": "https://pluralsight.imgix.net/author/lg/badaa186-4e07-4a6a-bad1-3b8c384ada4a.jpg?w=100",
                "author_about": "Gill Cleeren is a solution architect, author, and trainer in mobile and web technologies. He's also a Microsoft Regional Director and MVP. He lives in Tienen, Belgium.",
                "date": "Sep 7, 2021"
              }
    ] 
}