{
    "data": [
        {
            "title": "Clean, Transform, and Load Data with Power BI",
            "image": "https://pluralsight.imgix.net/course-images/clean-transform-load-data-power-bi-v1.jpg?h=180&w=320",
            "by": "Thomas LeBlanc",
            "rating": "(16)",
            "level": "Beginner",
            "time": "1h 3m",
            "shortDiscription": "This course will teach you cleansing, transforming, and loading functions of Power BI related to the DA-100 exam.",
            "discription": "Power BI has brought extract, transform and load features to this visualization tool through Power Query. In this course, Clean, Transform, and Load Data in Power BI, you will learn how to use Power Query in Power BI. First, Power Query will be connected to a data source and place in a development environment for cleansing. Next, transforming the data and structure will use Ribbon buttons to drive the final structure. Finally, loading the data involves the final steps for bring the data into the Power BI report canvas. When finished with this course, you will have the skills and knowledge required for passing the DA-100 exam section on clean, transform, and load data in Power BI.",
            "Author_Image_URL": "https://pluralsight.imgix.net/author/lg/aa6d1ec7-700c-4bad-a7e9-d99b249e0b61.jpg?w=100",
            "author_about": "Microsoft Data Platform MVP specializing in SQL Server, Microsoft Business Intelligence (SSIS, SSAS & SSRS) and Power BI.",
            "date": "Jul 21, 2021"
        },
        {
            "title": "Key Concepts Machine Learning",
            "image": "https://pluralsight.imgix.net/course-images/key-concepts-machine-learning-v1.jpg?h=180&w=320",
            "by": "Janani Ravi",
            "rating": "(11)",
            "level": "Beginner",
            "time": "2h 6m",
            "shortDiscription": "This course will introduce you to the concepts needed to identify use-cases for Machine Learning, formulate an ML problem, enumerate the canonical problems that ML is used to solve, and detail how ML is applied to complex data such as text, images and speech.",
            "discription": "Machine Learning algorithms have the ability to adapt and learn from past experiences. Machine learning is important because of its wide range of applications and its incredible ability to adapt and provide solutions to complex problems.          In this course, Key Concepts Machine Learning, you will learn to identify use-cases where ML can provide an appropriate solution, and recognize common structures in ML-based solutions.                       First, you will explore the limitations of rule-based approaches and how ML mitigates them. Then, you will discover the different types of ML models such as traditional models and representation models and see how you can develop the ML mindset to find solutions to meet your use case.                        Next, you will explore common ML use cases such as regression, classification, clustering, and dimensionality reduction and learn the differences between supervised and unsupervised learning. You will also study specialized use cases such as recommendation systems, association rules learning, and reinforcement learning, as well as learning to apply ML to complex data such as text, images, and speech data.                        Finally, you will learn how to formulate your use-case into one of these problem types so that it can then be solved with a commonly used ML-based approach.                        When you are finished with this course, you will have the skills and knowledge of the conceptual underpinnings of Machine Learning needed to recognize use-cases for ML, and adopt common ML approaches.",
            "Author_Image_URL": "https://pluralsight.imgix.net/author/lg/3e3f81ff-ccbc-4bf6-9136-a177f83cc9c2.jpg?w=100",
            "author_about": "A problem solver at heart, Janani has a Masters degree from Stanford and worked for 7+ years at Google. She was one of the original engineers on Google Docs and holds 4 patents for its real-time collaborative editing framework.",
            "date": "Nov 9, 2021"
        },
        {
            "title": "Literacy Essentials: Core Concepts Neural Network",
            "image": "https://pluralsight.imgix.net/course-images/literacy-essentials-core-concepts-neural-network-v1.jpg?h=180&w=320",
            "by": "Abdul Rehman Yousaf",
            "rating": "(26)",
            "level": "Beginne",
            "time": "48m",
            "shortDiscription": "This course will teach the core concepts of artificial neural networks: what they are and how they structure along with the vectorization of neural networks to attain optimal performance.",
            "discription": "Deep learning systems are capable of handling data in abundant volumes. As data is being generated at a rate that exceeds our expectations, the importance of deep learning is becoming more significant and prevailing in industries across the world. In this course, Literacy Essentials: Core Concepts Neural Network, you'll learn the basics of Artificial Neural Networks. First, you’ll explore a brief history of neural networks, specifically how they are inspired from biological neurons. Next, you’ll discover the basics of the structure of a neuron, how it connects to other neurons to form a neural network. Finally, you'll understand vectorization and how it can help us to improve the performance of neural networks. When you’re finished with this course, you’ll have the skills and knowledge of the core concepts of neural networks needed as the foundation to implement deep learning.",
            "Author_Image_URL": "https://pluralsight.imgix.net/author/lg/bc0a03d2-a7fd-4d5d-9cac-46702a3ab731.jpg?w=100",
            "author_about": "Abdul Rehman is the founder of Pythonist.org and a Machine Learning Engineer. He has held several senior software architectures and technical management roles, and he is a regular conference speaker. Python is his weapon of choice.",
            "date": "Nov 9, 2021"
        },
        {
            "title": "Working with Pointers and Arrays in C++ 20",
            "image": "https://pluralsight.imgix.net/course-images/working-pointers-arrays-cplusplus-20-v1.jpg?h=180&w=320",
            "by": "Mateo Prigl",
            "rating": "(43)",
            "level": "Intermediate",
            "time": "5h 2m",
            "shortDiscription": "Managing memory with pointers on a low level is one of the key building blocks of modern C++. This course will teach you how to use pointers and how they relate to arrays and dynamic memory management.",
            "discription": "C++ offers us high-level abstractions as a modern OOP language, but it also allows us to dig into the low-level memory management if needed. In this course, Working with Pointers and Arrays in C++ 20, you’ll learn to use pointers to indirectly access data from memory. First, you’ll explore what pointers are and how referencing works. Next, you’ll discover how this knowledge can be used for dynamic memory allocation and how pointers and arrays are related. Finally, you’ll learn how to use these skills to implement them in the modern C++ OOP environment. When you’re finished with this course, you’ll have the skills and knowledge of using indirection needed to work with pointers and arrays in C++20",
            "Author_Image_URL": "https://pluralsight.imgix.net/author/lg/670f8e5c-6145-463a-ba1b-f72eb3783513.jpeg?w=100",
            "author_about": "Mateo is currently a full stack web developer working for a company that has clients from Europe and North America. His niche in programming was mostly web oriented, while freelancing, working on small startups and companies that require his services. Go(lang), Elixir, Ruby and C are his favorite languages and also the ones he’s mostly working with other then PHP in day to day work. He has a big passion for learning and teaching what he knows the best. His big interests recently have been the fields of DevOps, Linux, functional programming and machine learning.",
            "date": "Nov 9, 2021"
        },
        {
            "title": "Cisco Collaboration Fundamentals",
            "image": "https://pluralsight.imgix.net/course-images/cisco-collaboration-fundamentals-media-resources-isr-call-voicemail-reporting-v3.jpg?h=180&w=320",
            "by": "Sean Douglas",
            "rating": "(18)",
            "level": "Intermediate",
            "time": "3h 21m",
            "shortDiscription": "Collaboration is in very high demand. This course will teach you how to deploy Cisco CUCM conferencing media resources, configure the Cisco ISR router to manage endpoints and the dial plan, set up Unity voicemail, and run traces and reports.",
            "discription": "More than ever, companies are relying on Cisco Collaboration solutions to ensure that they can communicate ubiquitously with their customers, employees, and everyone else. There is immense demand for administrators who have the knowledge and skills needed to manage and maintain their Cisco deployments. In this course, Cisco Collaboration Fundamentals: Managing Media Resources, ISR Call Control, Voicemail, and Reporting, you will see the step-by-step configurations to deploy media resources, manage IP phones using the ISR router, examine Cisco video technology, and run traces and reports.                       First, you will see how to give endpoints access to the CUCM and ISR audio conference bridges, music on hold, annunciator, and media termination point. Then, you will explore how to configure the Cisco ISR router to manage SCCP and SIP phones full-time using CME and, as a backup, SRST.                        Next, you will discover how to enable SIP URI dialing for endpoints and Jabber, so that users can place calls to email addresses. You will also learn about Cisco’s video conferencing technology.                        Finally, you will find out how to run reports and examine traces to help you troubleshoot your collaboration deployments.                        When you are finished with this course, you will have the skills and knowledge that today’s companies crave to manage and maintain their Cisco Collaboration solutions.",
            "Author_Image_URL": "https://pluralsight.imgix.net/author/lg/d216bf12-ea10-4094-bed9-5c3aba029a43.jpg?w=100",
            "author_about": "Sean Douglas has more than 17 years of experience working extensively with Cisco technology. He is a Cisco Systems Engineer that consults with a variety of clients to design, implement, and maintain their Cisco Collaboration solutions. Sean is CCNP in Routing and Switching, Wireless, and Collaboration.",
            "date": "Nov 9, 2021"
        },
        {
            "title": "ICAgile (ICP-FDO): Continuous Delivery",
            "image": "https://pluralsight.imgix.net/course-images/icagile-icp-fdo-continuous-delivery-v1.jpg?h=180&w=320",
            "by": "Chris Behrens",
            "rating": "(29)",
            "level": "Intermediate",
            "time": "1h 37m",
            "shortDiscription": "Continuous Deployment means beginning with the deployment end in mind. This course will teach you what that means and how to install deployment as a first-class artifact in your team’s thinking.",
            "discription": "If you want to implement Continuous Deployment in your Enterprise, you can’t simply bolt it on at the end. In this course ICAgile (ICP-FDO): Continuous Delivery, you’ll learn to install deployment as a first-class artifact in your team’s thinking. First, you’ll explore the human changes needed to move ahead. Next, you’ll discover the role of build engineering in CD. Finally, you’ll learn how to automate your deployments to Production and elsewhere. When you’re finished with this course, you’ll have the skills and knowledge of Continuous Deployment needed to take your enterprise to the next level of effectiveness in deployment.",
            "Author_Image_URL": "https://pluralsight.imgix.net/author/lg/c4526d52-9723-40bb-90d1-5d5268725d36.jpg?w=100",
            "author_about": "Chris B. Behrens is a writer, speaker and software developer, specializing in DevOps. He has been a developer and architect for more than twenty years focusing on small to medium size companies and the development changes they face.",
            "date": "Nov 9, 2021"
        },
        {
            "title": "Enhance Reports to Expose Insights",
            "image": "https://pluralsight.imgix.net/course-images/enhance-reports-expose-insights-power-bi-v1.jpg?h=180&w=320",
            "by": "Ifedayo Bamikole",
            "rating": "(19)",
            "level": "Advanced",
            "time": "54m",
            "shortDiscription": "This course will go through several features in Power BI that will give your report ability to easily answer questions about your dataset.",
            "discription": "Reports are a key part of any Data Strategy. They are used to present information in a way that can be easily consumed. But there are times where the intentions of a report does not always meet the expectation of the end user. This can be because of how different the dataset is or just not having the right features available to enhance the presentation of the dataset. In this course, Enhance Reports to Expose Insights with Power BI, you’ll learn of different techniques in Power BI that will ensure your reports are being presented in a way that will cater to all types of end user. First, you’ll explore what these techniques are in Power BI. Next, you’ll discover some use cases of when they can be applied. Finally, you’ll learn how to enable each of these techniques in a Power BI environment. When you’re finished with this course, you’ll have the skills and knowledge to enhance your Power BI Reports needed to cater to various end users irrespective of the dataset.",
            "Author_Image_URL": "https://pluralsight.imgix.net/author/lg/a47cf717-0d87-4f42-b014-c46776818761.jpg?w=100",
            "author_about": "Ifedayo is a tech specialist with expertise in Cloud Data Solutions, Artificial intelligence, and Web Development. He loves teaching and watching people learn.",
            "date": "Nov 9, 2021"
        },
        {
            "title": "Using ServiceNow Reports and Dashboards",
            "image": "https://pluralsight.imgix.net/course-images/servicenow-using-reports-dashboards-v1.jpg?h=180&w=320",
            "by": "Saravanan Dhandapani",
            "rating": "(39)",
            "level": "Intermediate",
            "time": "1h 4m",
            "shortDiscription": "In today’s fast-paced world, enterprises are looking for no-code or low-code solutions. This course will teach you to leverage the ServiceNow reporting framework and build meaningful reports and dashboards.",
            "discription": "Executives rely on reports and dashboards in making strategic decisions to beat the competition. In this course, Using ServiceNow Reports and Dashboards, you’ll learn to use the ServiceNow reporting framework and create meaningful reports and build dashboards. First, you’ll explore the various report types supported by ServiceNow and the business cases where they can be used. Next, you’ll discover how to create a report using the ServiceNow report designer. Then you will explore how to share and publish the report with other ServiceNow users. Finally, you’ll learn how to build executive dashboards using custom and built-in reports. When you’re finished with this course, you’ll have the skills and knowledge to leverage the ServiceNow platform needed to create dynamic reports and dashboards.",
            "Author_Image_URL": "https://pluralsight.imgix.net/author/lg/c696ca21-be79-461e-a909-73f8618730f9.jpg?w=100",
            "author_about": "I have been passionate about designing and developing software that is scalable, portable and maintainable.",
            "date": "Nov 9, 2021"
        },
        {
            "title": "Manage Account Access with Salesforce Territory",
            "image": "https://pluralsight.imgix.net/course-images/manage-account-access-salesforce-territory-mgmt-v1.jpg?h=180&w=320",
            "by": "Sara Morgan Nettles",
            "rating": "(42)",
            "level": "Intermediate",
            "time": "46m",
            "shortDiscription": "This course will help you prepare for the Salesforce Certified Sharing and Visibility Designer exam. Using a real-world scenario involving a global company you will learn how to manage account ownership using Enterprise Territory Management.",
            "discription": "If you have been following along with this path, then you know that it is now time to complete the Salesforce sharing model and set up Territory Management. In this course, Manage Account Access with Salesforce Territory Management, you will learn how to successfully set up a Territory model for a Salesforce organization. First, you will learn about what Enterprise Territory Management is and the benefits it provides. Next, you will learn how to create a model, along with territories and user roles. And finally, you will find out how to add users to territories and run assignment rules that impact your record sharing model. By the end of this course, you will know how to set up Enterprise Territory Management and manage territory assignments in your Salesforce organization.",
            "Author_Image_URL": "https://pluralsight.imgix.net/author/lg/sara-morgan-v1.jpg?w=100",
            "author_about": "Sara Morgan Nettles is a Certified Salesforce Platform I and II developer, who began her software development career twenty years ago working primarily with Microsoft technologies. She now focuses on sharing her knowledge of developing modern web applications on the Salesforce platform. She has authored numerous books and articles, as well as being a regular speaker at Dreamforce.",
            "date": "Nov 9, 2021"
        },
        {
            "title": ".NET 6 First Look",
            "image": "https://pluralsight.imgix.net/course-images/dot-net-6-first-look-v1.jpg?h=180&w=320",
            "by": "Gill Cleeren",
            "rating": "(21)",
            "level": "Beginner",
            "time": "1h 52m",
            "shortDiscription": ".NET 6.0 comes packed with changes. Alongside, Visual Studio 2022 will be released in parallel. This course will teach you what you can expect in this latest iteration of the platform and its IDE.",
            "discription": ".NET 6.0 contains many new features. Developers need to be ready for the new version. In this course, .NET 6 First Look, you’ll learn what’s new with this release, what is changing, and what influence .NET 6.0 will have on your existing projects. First, you’ll explore the unification of the different .NET platforms which is happening with this release. Next, you’ll discover the new version of Visual Studio and C#. Finally, you’ll learn about the different technologies and their statuses, including ASP.NET Core, Blazor, and Maui. When you’re finished with this course, you’ll have a good understanding of what’s coming with the .NET 6.0 release, due for November 2021.",
            "Author_Image_URL": "https://pluralsight.imgix.net/author/lg/badaa186-4e07-4a6a-bad1-3b8c384ada4a.jpg?w=100",
            "author_about": "Gill Cleeren is a solution architect, author, and trainer in mobile and web technologies. He's also a Microsoft Regional Director and MVP. He lives in Tienen, Belgium.",
            "date": "Nov 8, 2021"
        }
    ]
}
